<template>
  <div id="app">
    
  </div>
</template>
<script>
const codeList = [
  "OK",
  "表示数据包接收错误",
  "表示传感器上没有手指",
  "表示录入指纹图像失败",
  "表示指纹图像太干、太淡而生不成特征",
  "表示指纹图像太湿、太糊而生不成特征",
  "表示指纹图像太乱而生不成特征",
  "表示指纹图像正常，但特征点太少(或面积太小)而生不成特征",
  "表示指纹不匹配",
  "表示没搜索到指纹",
  "表示特征合并失败",
  "表示访问指纹库时地址序号超出指纹库范围",
  "表示从指纹库读模板出错或无效",
  "表示上传特征失败",
  "表示模块不能接受后续数据包",
  "表示上传图像失败",
  "表示删除模板失败",
  "表示清空指纹库失败",
  "表示不能进入低功耗状态",
  "表示口令不正确",
  "表示系统复位失败",
  "表示缓冲区内没有有效原始图而生不成图像",
  "表示在线升级失败",
  "表示残留指纹或两次采集之间手指没有移动过",
  "表示读写FLASH 出错",
  "有后续数据包的指令，正确接收后用0xf0 应答",
  "有后续数据包的指令，命令包用0xf1 应答",
  "表示烧写内部FLASH 时，校验和错误",
  "表示烧写内部FLASH 时，包标识错误",
  "表示烧写内部FLASH 时，包长度错误",
  "表示烧写内部FLASH 时，代码长度太长",
  "表示烧写内部FLASH 时，烧写FLASH 失败",
  "未定义错误",
  "无效寄存器号",
  "寄存器设定内容错误号",
  "记事本页码指定错误",
  "端口操作失败",
  "自动注册(enroll)失败",
  "指纹库",
  "Reserve"
];

export default {
  name: "app",
  data() {
    return {};
  },
  methods:{
    
  }
};
</script>
<style lang="less">
@import "../base/reset.css";
</style>
<style lang="less" scoped>
#app {
  width: 100%;
  height: 100%;
}
</style>